In [3]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [6]:
data=pd.read_csv('https://raw.githubusercontent.com/SKawsar/Data_Visualization_with_Python/main/skoda.csv')

In [7]:
data.describe()

              year         price        mileage          mpg   engineSize
count  6267.000000   6267.000000    6267.000000  6267.000000  6267.000000
mean   2017.502314  14275.449338   20118.452050    56.589165     1.433509
std       1.734754   6332.051106   19955.410762    12.037576     0.394800
min    2004.000000    995.000000       5.000000    30.100000     0.000000
25%    2017.000000   9495.000000    5812.500000    50.400000     1.000000
50%    2018.000000  12998.000000   14653.000000    57.700000     1.400000
75%    2019.000000  17990.000000   28000.000000    62.800000     2.000000
max    2020.000000  91874.000000  300000.000000   201.800000     2.500000

In [9]:
data.columns

Index(['model', 'year', 'price', 'transmission', 'mileage', 'fuelType', 'mpg',
       'engineSize'],
      dtype='object')

In [10]:
data.dtypes

model            object
year              int64
price             int64
transmission     object
mileage           int64
fuelType         object
mpg             float64
engineSize      float64
dtype: object

In [11]:
data.isna().sum()

model           0
year            0
price           0
transmission    0
mileage         0
fuelType        0
mpg             0
engineSize      0
dtype: int64

In [37]:
# list of top 5 selling car models
list(data.groupby('model')['price'].agg(['count']).sort_values(by='count',ascending=False).index)[:5]

[' Fabia', ' Octavia', ' Superb', ' Kodiaq', ' Citigo']

In [ ]:
#average selling price of the top 5 selling car models

In [57]:
data.groupby('model')['price'].agg(['count','mean']).sort_values(by='count',ascending=False).reset_index().iloc[0:5,[0,2]]

      model          mean
0     Fabia   9906.497136
1   Octavia  13991.955315
2    Superb  18898.257901
3    Kodiaq  25652.368644
4    Citigo   6925.561702

In [59]:
#total sale of the top 5 selling cars models
data.groupby('model')['price'].agg(['count','sum']).sort_values(by='count',ascending=False).reset_index().iloc[0:5,[0,2]]

      model       sum
0     Fabia  15563107
1   Octavia  20666118
2    Superb  14948522
3    Kodiaq  12107918
4    Citigo   3255014

In [62]:
# EDA on transmission
transmission=data.groupby('transmission')['price'].agg(['count','sum','mean']).sort_values(by='count',ascending=False)

In [ ]:
# EDA on fuelType
fuelType=data.groupby('fuelType')